# Programming Machine Learning Home Work Assignment1

In [1]:
# import all the necessary python packages for this task
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Enable inline plotting
%matplotlib inline

<p>Load the data into Pandas</p>

In [2]:
#%pwd
fileName = r'../../data/adult-modified.csv'
df = pd.read_csv(fileName, sep=',')

# the first top 10 records
df.head(10)

,age,workclass,education,marital-status,race,sex,hours-per-week,income
0,39,Public,13,Single,White,Male,40,<=50K
1,50,Self-emp,13,Married,White,Male,13,<=50K
2,38,Private,9,Single,White,Male,40,<=50K
3,53,Private,7,Married,Black,Male,40,<=50K
4,28,Private,13,Married,Black,Female,40,<=50K
5,37,Private,14,Married,White,Female,40,<=50K
6,49,Private,5,Married,Black,Female,16,<=50K
7,52,Self-emp,9,Married,White,Male,45,>50K
8,31,Private,14,Single,White,Female,50,>50K
9,42,Private,13,Married,White,Male,40,>50K

In [3]:
# the last 10 records of the data set
df.tail(10)

,age,workclass,education,marital-status,race,sex,hours-per-week,income
9402,18,Private,8,Single,White,Female,25,<=50K
9403,55,Public,10,Single,White,Male,40,<=50K
9404,44,Private,9,Single,Black,Female,40,<=50K
9405,38,Private,9,Married,White,Female,15,<=50K
9406,34,Self-emp,11,Married,White,Male,75,<=50K
9407,38,Private,10,Married,White,Male,60,>50K
9408,25,Private,9,Single,White,Female,8,<=50K
9409,21,Private,10,Single,Black,Male,40,<=50K
9410,38,Private,2,Married,White,Male,53,<=50K
9411,39,Private,10,Single,White,Female,40,<=50K

<p>Data Frame MetaData.</p>

In [4]:
df.columns

Index(['age', 'workclass', 'education', 'marital-status', 'race', 'sex',
       'hours-per-week', 'income'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9412 entries, 0 to 9411
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             9412 non-null   int64
 1   workclass       9412 non-null   object
 2   education       9412 non-null   int64
 3   marital-status  9412 non-null   object
 4   race            9412 non-null   object
 5   sex             9412 non-null   object
 6   hours-per-week  9412 non-null   int64
 7   income          9412 non-null   object
dtypes: int64(3), object(5)
memory usage: 588.4+ KB

In [6]:
df.describe(include='all')

,age,workclass,education,marital-status,race,sex,hours-per-week,income
count,9412.000000,9412,9412.000000,9412,9412,9412,9412.000000,9412
unique,NaN,3,NaN,2,5,2,NaN,2
top,NaN,Private,NaN,Married,White,Male,NaN,<=50K
freq,NaN,6947,NaN,4737,8062,6383,NaN,7093
mean,38.357310,NaN,10.125266,NaN,NaN,NaN,41.080217,NaN
std,12.962135,NaN,2.542118,NaN,NaN,NaN,11.884590,NaN
min,17.000000,NaN,1.000000,NaN,NaN,NaN,1.000000,NaN
25%,28.000000,NaN,9.000000,NaN,NaN,NaN,40.000000,NaN
50%,37.000000,NaN,10.000000,NaN,NaN,NaN,40.000000,NaN
75%,47.000000,NaN,13.000000,NaN,NaN,NaN,45.000000,NaN
max,90.000000,NaN,16.000000,NaN,NaN,NaN,99.000000,NaN

In [7]:
educationUniqueNos = df['education'].unique()
educationUniqueNos

array([13,  9,  7, 14,  5, 10, 12, 11,  4, 16, 15,  3,  6,  1,  8,  2],
      dtype=int64)

In [8]:
df['workclass'].unique()

array(['Public', 'Self-emp', 'Private'], dtype=object)

In [9]:
# count the number of records for each category in a column
df['workclass'].value_counts()

Private     6947
Public      1317
Self-emp    1148
Name: workclass, dtype: int64

In [10]:
# count the number of records for each category in a column
df['marital-status'].value_counts()

Married    4737
Single     4675
Name: marital-status, dtype: int64

In [11]:
df['race'].unique()

array(['White', 'Black', 'Asian', 'Amer-Indian', 'Hispanic'], dtype=object)

In [12]:
# count the number of records for each category in a column
df['race'].value_counts()

White          8062
Black           892
Asian           291
Amer-Indian      92
Hispanic         75
Name: race, dtype: int64

In [13]:
df['sex'].unique()

array(['Male', 'Female'], dtype=object)

In [14]:
# count the number of records for each category in a column
df['sex'].value_counts()

Male      6383
Female    3029
Name: sex, dtype: int64

In [15]:
df['income'].unique()

array(['<=50K', '>50K'], dtype=object)

In [16]:
# count the number of records for each category in a column
df['income'].value_counts()

<=50K    7093
>50K     2319
Name: income, dtype: int64

In [17]:
# the average age for male versus female
df[['sex','age']].groupby(['sex']).mean()

              age
sex
Female  37.006273
Male    38.998433

In [18]:
# the average age for each race
df[['race','age']].groupby(['race']).mean()

                   age
race
Amer-Indian  36.934783
Asian        37.769759
Black        38.010090
Hispanic     33.733333
White        38.476185

In [19]:
# The number of workers in each workclass
df.groupby(['workclass'])['workclass'].count()

workclass
Private     6947
Public      1317
Self-emp    1148
Name: workclass, dtype: int64

In [20]:
# value_counts() method used to derive the number of workers in each workclass
df['workclass'].value_counts()

Private     6947
Public      1317
Self-emp    1148
Name: workclass, dtype: int64

In [21]:
# the average age for marital status
df[['marital-status', 'age']].groupby(['marital-status']).mean()

                      age
marital-status
Married         43.265358
Single          33.384171